{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "GPTNeoForCausalLM",
    "parent_library": "transformers.models.gpt_neo.modeling_gpt_neo"
  },
  "base_model_name_or_path": "EleutherAI/gpt-neo-1.3B",
  "bias": "lora_only",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": [],
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "attn.attention.v_proj",
    "attn.attention.q_proj"
  ],
  "task_type": null
}